MS1LG    DFHMSD TYPE=&SYSPARM,                                         X00010000
               MODE=INOUT,                                             X00020000
               CTRL=FREEKB,                                            X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES,                                            X00050000
               DSATTS=COLOR,                                           X00060000
               MAPATTS=COLOR,                                          X00070000
               STORAGE=AUTO                                             00080000
*********************************************************************** 00090000
MAP1LG   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1                            00100000
*********************************************************************** 00110000
         DFHMDF POS=(1,1),                                             X00110100
               LENGTH=79,                                              X00110200
               INITIAL='***********************************************X00110300
               ********************************',                      X00110400
               ATTRB=(ASKIP,PROT)                                       00110500
         DFHMDF POS=(2,1),                                             X00110600
               LENGTH=2,                                               X00110700
               INITIAL='* ',                                           X00110800
               ATTRB=(ASKIP,PROT)                                       00110900
         DFHMDF POS=(2,3),                                             X00111000
               LENGTH=08,                                              X00111100
               INITIAL=' DATE : ',                                     X00111200
               ATTRB=(ASKIP,PROT),COLOR=YELLOW                          00111300
*********************************************************************** 00111400
** DATE                                                                 00111500
*********************************************************************** 00111600
DATEJ    DFHMDF POS=(2,14),                                            X00111700
               LENGTH=10,                                              X00111800
               INITIAL=' ',                                            X00111900
               ATTRB=(ASKIP,PROT,FSET)                                  00112000
         DFHMDF POS=(2,24),                                            X00112100
               LENGTH=06,                                              X00112200
               INITIAL='PGM : ',COLOR=RED,                             X00112300
               ATTRB=(ASKIP,PROT)                                       00112400
*********************************************************************** 00112500
** PGMNAME                                                              00112600
*********************************************************************** 00112700
PGMNAME  DFHMDF POS=(2,30),                                            X00112800
               LENGTH=09,                                              X00112900
               INITIAL=' ',COLOR=RED,                                  X00113000
               ATTRB=(ASKIP,PROT,FSET)                                  00113100
         DFHMDF POS=(2,39),                                            X00113200
               LENGTH=07,                                              X00113300
               INITIAL='TRANS: ',COLOR=RED,                            X00113400
               ATTRB=(ASKIP,PROT)                                       00113500
*********************************************************************** 00113600
** TRNNAME                                                              00113700
*********************************************************************** 00113800
TRNNAME  DFHMDF POS=(2,46),                                            X00113900
               LENGTH=07,                                              X00114000
               INITIAL=' ',COLOR=RED,                                  X00114100
               ATTRB=(ASKIP,PROT,FSET)                                  00114200
         DFHMDF POS=(2,53),                                            X00114300
               LENGTH=08,                                              X00114400
               INITIAL='HEURE : ',                                     X00114500
               ATTRB=(ASKIP,PROT),COLOR=YELLOW                          00114600
*********************************************************************** 00114700
** HEURE                                                                00114800
*********************************************************************** 00114900
HEURE    DFHMDF POS=(2,62),                                            X00115000
               LENGTH=08,                                              X00115100
               INITIAL=' ',                                            X00115200
               ATTRB=(ASKIP,PROT,FSET)                                  00115300
         DFHMDF POS=(2,79),                                            X00115400
               LENGTH=1,INITIAL='*',                                   X00115500
               ATTRB=(ASKIP,PROT)                                       00115600
         DFHMDF POS=(3,1),                                             X00115700
               LENGTH=79,                                              X00115800
               INITIAL='***********************************************X00115900
               ********************************',                      X00116000
               ATTRB=(ASKIP,PROT)                                       00117000
*********************************************************************** 00117100
** INSTRUCTIONS                                                         00117200
*********************************************************************** 00117300
         DFHMDF POS=(05,01),                                           X00117400
               LENGTH=30,                                              X00117500
               ATTRB=PROT,                                             X00117600
               COLOR=NEUTRAL,                                          X00117700
               INITIAL='      LOGIN      '                              00117802
         DFHMDF POS=(07,01),                                           X00117900
               LENGTH=43,                                              X00118000
               ATTRB=PROT,                                             X00118100
               COLOR=NEUTRAL,                                          X00118200
               INITIAL='TAPER VOTRE NOM ET MOT DE PASSE'                00118302
*********************************************************************** 00118400
** LOGIN                                                                00118502
*********************************************************************** 00118600
         DFHMDF POS=(09,01),                                           X00118700
               LENGTH=19,                                              X00118800
               ATTRB=PROT,                                             X00118900
               COLOR=GREEN,                                            X00119000
               INITIAL='LOGIN ..............'                           00119102
LOGIN    DFHMDF POS=(09,21),                                           X00119201
               LENGTH=20,                                              X00119303
               INITIAL='____________________',                         X00119404
               ATTRB=(UNPROT,IC),                                      X00119503
               PICIN='X(20)',                                          X00119603
               PICOUT='X(20)',                                         X00119703
               COLOR=TURQUOISE                                          00119800
         DFHMDF POS=(09,42),                                           X00119904
               LENGTH=1,                                               X00120000
               ATTRB=ASKIP                                              00121000
*********************************************************************** 00130000
** PWD                                                                  00131002
*********************************************************************** 00132000
         DFHMDF POS=(11,01),                                           X00133000
               LENGTH=19,                                              X00134000
               ATTRB=PROT,                                             X00135000
               COLOR=GREEN,                                            X00136000
               INITIAL='PWD ..............'                             00137001
PWD      DFHMDF POS=(11,21),                                           X00138001
               LENGTH=20,                                              X00139003
               INITIAL='____________________',                         X00139104
               ATTRB=(UNPROT),                                         X00139203
               PICIN='X(20)',                                          X00139303
               PICOUT='X(20)',                                         X00139403
               COLOR=TURQUOISE                                          00139500
         DFHMDF POS=(11,42),                                           X00139604
               LENGTH=1,                                               X00139700
               ATTRB=ASKIP                                              00139800
*********************************************************************** 00141500
** BAS DE PAGE                                                          00141600
*********************************************************************** 00141700
         DFHMDF POS=(17,1),                                            X00141800
               LENGTH=79,                                              X00141900
               INITIAL='***********************************************X00142000
               ********************************',                      X00143000
               ATTRB=(ASKIP,PROT)                                       00144000
         DFHMDF POS=(18,1),                                            X00145000
               LENGTH=78,                                              X00146000
               INITIAL='* ESC : FIN  ENTER : LOGIN ',                  X00147003
               ATTRB=(ASKIP,PROT)                                       00149000
         DFHMDF POS=(18,79),                                           X00150000
               LENGTH=1,                                               X00160000
               INITIAL='*',                                            X00170000
               ATTRB=(ASKIP,PROT)                                       00180000
         DFHMDF POS=(19,1),                                            X00190000
               LENGTH=12,                                              X00200000
               INITIAL='* MESSAGE : ',                                 X00210000
               ATTRB=(ASKIP,PROT)                                       00220000
*********************************************************************** 00230000
** MESS1                                                                00240000
*********************************************************************** 00250000
MESS1    DFHMDF POS=(19,14),                                           X00260000
               LENGTH=55,                                              X00270000
               ATTRB=(ASKIP,PROT,BRT)                                   00280000
         DFHMDF POS=(19,79),                                           X00290000
               LENGTH=1,                                               X00300000
               INITIAL='*',                                            X00310000
               ATTRB=(ASKIP,PROT)                                       00320000
         DFHMDF POS=(20,1),                                            X00330000
               LENGTH=1,                                               X00340000
               INITIAL='*',                                            X00350000
               ATTRB=(ASKIP,PROT)                                       00360000
*********************************************************************** 00370000
** MESS2                                                                00380000
*********************************************************************** 00390000
MESS2    DFHMDF POS=(20,14),                                           X00400000
               LENGTH=56,                                              X00410000
               ATTRB=(ASKIP,PROT,BRT)                                   00420000
         DFHMDF POS=(20,79),                                           X00430000
               LENGTH=1,                                               X00440000
               INITIAL='*',                                            X00450000
               ATTRB=(ASKIP,PROT)                                       00460000
*********************************************************************** 00470000
** SEPARATEUR + FIN                                                     00480000
*********************************************************************** 00490000
         DFHMDF POS=(21,1),                                            X00500000
               LENGTH=79,                                              X00510000
               INITIAL='***********************************************X00520000
               ********************************',                      X00530000
               ATTRB=(ASKIP,PROT)                                       00540000
         DFHMSD TYPE=FINAL                                              00550000
         END                                                            00560000
