000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.  A1PGMLG.
000300
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000501
000502 INPUT-OUTPUT SECTION.
000503 FILE-CONTROL.
000504******** KSDS FILE EMPK FOR AUTHENTIFICATION
000505*    SELECT EMPK ASSIGN TO EMPKSDS
000506*    ORGANIZATION IS INDEXED
000507*    ACCESS MODE IS DYNAMIC
000508*    RECORD KEY IS CODE-EMPK
000509*    FILE STATUS IS FS-EMPK.
000510
000600 DATA DIVISION.
000601*FILE SECTION.
000602*FD EMPK.
000603*01 ENR-EMPK.
000604*    05 CODE-EMPK      PIC X(5).
000605*    05 NOM-EMPK       PIC X(5).
000606*    05 PREN-EMPK      PIC X(5).
000607*    05 CP-EMPK        PIC X(5).
000608*    05 VILLE-EMPK     PIC X(5).
000609*    05 SALAIRE-EMPK   PIC X(5).
000610*    05 FILLER         PIC X(3).
000611
000700 WORKING-STORAGE SECTION.
000800     COPY DFHBMSCA.
000900     COPY DFHAID.
001000     COPY MS1LG.
001100
001200 01 ZONE.
001300   05 COMMA-PGM   PIC X(8).
001400   05 FILLER      PIC X(12).
001500   05 INFOS       PIC X(50).
001600
001700 77 WS-NOM-PROG   PIC X(8) VALUE 'A1PGMPA'.
001800
001900 77 WS-TEMPS      PIC S9(15) COMP-3.
002000 77 WS-CD-ERR     PIC 99.
002100 77 WS-ERR-MESS   PIC X(50) VALUE 'FIN NORMALE'.
002200
002400 77 WS-MSG        PIC X(50).
002401
002402 77 FS-EMPK       PIC 99 VALUE ZERO.
002403 01 ENR-EMPK.
002404     05 CODE-EMPK      PIC X(5).
002405     05 NOM-EMPK       PIC X(15).
002406     05 PREN-EMPK      PIC X(15).
002407     05 CP-EMPK        PIC X(5).
002408     05 VILLE-EMPK     PIC X(20).
002409     05 SALAIRE-EMPK   PIC 9(5)V99.
002410     05 FILLER         PIC X(3).
002420 77 ENR-EMPK-LENGTH    PIC 99 VALUE 70.
002500
002600******************************************************************
002700*    ZONE A DESTINATION DE NOTRE PROG APPELE VIA LINK - A1CALC
002800******************************************************************
002900 01 INFOS-300-FIND-EMP.
003000   05 WS-LOGIN      PIC X(5).
003100   05 WS-PWD        PIC X(20).
003300   05 WS-FLAG       PIC 9.
003400    88 300-FIND-EMP-OK VALUE ZERO.
003500    88 300-FIND-EMP-KO VALUE 1.
003600   05 ED-RES        PIC ZZBZZ9.99.
003700
003800
003900
004000
004100
004200
004300 PROCEDURE DIVISION.
004400
004500     EVALUATE EIBTRNID
004600         WHEN 'T1LG'
004700*********** PREMIERE FOIS QU'ON AFFICHE LA MAP (EIBCALEN = 0)
004800            IF EIBCALEN = ZERO
004900                   MOVE 'A1PGMLG' TO COMMA-PGM
005000                   MOVE LOW-VALUE TO MAP1LGO
005100                   PERFORM  100-ENVOI-ECRAN
005200            ELSE
005300                 PERFORM 200-GESTION-TOUCHES
005400            END-IF
005500         WHEN OTHER
005600              CONTINUE
005700     END-EVALUATE
005800     PERFORM  100-ENVOI-ECRAN.
005900
006000******************************************************************
006100*            LISTE DES PARAGRAPHES
006200******************************************************************
006201******************************************************************
006202*
006203* 100-XXXXXX IO
006204*
006205******************************************************************
006300  100-ENVOI-ECRAN.
006400
006500      MOVE COMMA-PGM TO PGMNAMEO
006600      MOVE EIBTRNID  TO TRNNAMEO
006700
006800      EXEC CICS ASKTIME
006900            ABSTIME (WS-TEMPS)
007000      END-EXEC
007100
007200      EXEC CICS
007300         FORMATTIME ABSTIME (WS-TEMPS)
007400         DDMMYY (DATEJO)
007500         DATESEP('/')
007600         TIME (HEUREO)
007700         TIMESEP(':')
007800      END-EXEC
007900
008000      EXEC CICS
008100         SEND MAP('MAP1LG')
008200              MAPSET('MS1LG')
008300              RESP(WS-CD-ERR)
008400              ERASE
008500              CURSOR
008600      END-EXEC
008700      IF WS-CD-ERR NOT EQUAL DFHRESP(NORMAL)
008800                  MOVE 'ERR SEND' TO WS-ERR-MESS
008900                  PERFORM 900-FIN-TOTALE
009000      END-IF
009100
009200
009300******************************************************************
009400*     REAFFICHER LA TRANSACTION T1LG,
009500*            REDONNER LA MAIN A L'USER POUR VISUALISER
009600*         ET EFFECTUER LES SAISIES
009700******************************************************************
009800
009900       EXEC CICS
010000            RETURN TRANSID ('T1LG')
010100            COMMAREA (ZONE)
010200            LENGTH (LENGTH OF ZONE)
010300       END-EXEC
010400       .
010500
010600 100-LECT-ECRAN.
010700      EXEC CICS
010800           RECEIVE MAP ('MAP1LG')
010900                   MAPSET ('MS1LG')
011000                   RESP (WS-CD-ERR)
011100      END-EXEC
011200      IF WS-CD-ERR NOT EQUAL DFHRESP(NORMAL)
011300                  MOVE 'ERR RECE' TO WS-ERR-MESS
011400                  PERFORM 900-FIN-TOTALE
011500      END-IF.
011600
011601******************************************************************
011602*
011603*  200-XXXXXXX CONTROLE
011604*
011605******************************************************************
011606 200-GESTION-TOUCHES.
011607*********** RECUPERE LA TOUCHE PRESSEE
011609      INITIALIZE WS-MSG
011610      EVALUATE TRUE
011611*********** TOUCHE CLEAR
011612          WHEN EIBAID = DFHCLEAR
011613               MOVE 'BYE' TO WS-ERR-MESS
011614               PERFORM 900-FIN-TOTALE
011615*********** TOUCHE  ENTER
011616          WHEN EIBAID = DFHENTER
011617               INITIALIZE MESS1O MESS2O
011618               MOVE 'VOUS AVEZ APPUYE SUR ENTR '  TO MESS1O
011619               PERFORM 100-LECT-ECRAN
011620               PERFORM 300-TRAIT-LOGIN-PWD
011625          WHEN OTHER
011626               INITIALIZE MESS1O MESS2O
011627               MOVE 'TOUCHE INVALIDE !' TO MESS1O
011628               MOVE DFHPINK TO MESS1C
011629      END-EVALUATE.
011630
011631
011632******************************************************************
011633*
011634*  300-XXXXXXX   TRAITEMENT
011635*
011636******************************************************************
011637*************************************************************
011638*  TRAIT LOGIN PWD
011639*     TRAITEMENT A LA SUITE D'UNE SAISIE DE LA TOUCHE ENTER
011640*
011641*     VERIFICATION DE LA SAISIE DES CHAMPS LOGIN ET PWD
011642*     SI SAISIE OK ALORS VERIFICATION DANS LE FICHIER
011643*     EMPLOYE.KSDS SI LOGIN EST PR SENT, PUIS SI LOGIN EST
011644*     PR SENT ALORS VERIF QUE PWD = PRENOM
011645*
011646*************************************************************
011700 300-TRAIT-LOGIN-PWD.
011800     INITIALIZE MESS1O MESS2O
011900     IF LOGINI NOT EQUAL SPACE AND PWDI NOT EQUAL SPACE
011910          MOVE 'TOTO' TO MESS1O
012000          PERFORM 300-FIND-EMP
012100     ELSE
012200          MOVE 'LOGIN ET/OU PWD EST INVALIDE(S)' TO MESS2O
012300     END-IF.
012301
012400******* APPEL PROGRAMME AJOUT DE PI CE
015100 310-APP-PARTS-XCTL.
015200      EXEC CICS
015300        XCTL PROGRAM (WS-NOM-PROG)
015400             COMMAREA (ZONE)
015500             LENGTH (LENGTH OF ZONE)
015600             RESP (WS-CD-ERR)
015700
015800      END-EXEC
015900
016000     IF WS-CD-ERR  NOT EQUAL  DFHRESP(NORMAL)
016100       MOVE 'ERR LINK' TO WS-ERR-MESS
016200       PERFORM 900-FIN-TOTALE
016300     END-IF
016400     .
016500
016501
016502************************
016503*
016504*    FIND-EMP :
016505*
016506*       INTERROGATION DU FICHIER EMPLOYE.KSDS
016507*       POUR RECHERCHE DU LOGIN ET DU MOT DE PASSE
016508******************************
016600 300-FIND-EMP.
016700     MOVE LOGINI TO WS-LOGIN
016810     INITIALIZE WS-PWD
016900     STRING
017000        PWDI DELIMITED BY '__'
017700     INTO WS-PWD
017701
017702     EXEC CICS
017703      READ DATASET('USERS1')
017706        INTO (ENR-EMPK)
017709          RIDFLD (WS-LOGIN)
017711          RESP(WS-CD-ERR)
017712     END-EXEC
017714     EVALUATE WS-CD-ERR
017716        WHEN 13
017717             MOVE 'LOGIN NOT FOUND' TO MESS1O
017718             MOVE WS-LOGIN TO MESS2O
017720        WHEN 0
017721             IF PREN-EMPK = WS-PWD THEN
017722               MOVE 'LOGIN OK' TO MESS1O
017723        PERFORM 310-APP-PARTS-XCTL
017724             ELSE
017725               MOVE 'ERREUR PWD' TO MESS1O
017726               MOVE WS-PWD TO MESS2O
017727             END-IF
017728        WHEN OTHER
017729             MOVE WS-CD-ERR TO WS-ERR-MESS
017730             PERFORM 900-FIN-TOTALE
017731     END-EVALUATE
018200     EXIT.
020300
020400
020500 900-FIN-TOTALE.
020600      EXEC CICS
020700         SEND FROM (WS-ERR-MESS)
020800              LENGTH (LENGTH OF WS-ERR-MESS)
020900              WAIT
021000              ERASE
021100      END-EXEC
021200      EXEC CICS     RETURN    END-EXEC.
021300
021400

