//JA1PGMPA JOB (ACCT#),'GAYLORD',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,TIME=(0,5),
//    COND=(4,LT)
//*
//         JCLLIB  ORDER=SDJ.FORM.PROCLIB
//*
//COMPCIC  EXEC COMPCICS,NOMPGM=A1PGMPA
//STEPCIC.SYSIN    DD DSN=API5.SOURCE.COBOL(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API5.COB.CPY,DISP=SHR
/*
