000100 ID DIVISION.
000200 PROGRAM-ID.  ASSEQ.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600
000800 LINKAGE SECTION.
000900 COPY TESTCONT.
001000 01 TEST-NAME   PIC X(30).
001100 01 EXPECTED    PIC X(10).
001200 01 ACTUAL      PIC X(10).
001300
001400 PROCEDURE DIVISION USING TEST-CONTEXT
001500                          TEST-NAME
001600                          EXPECTED
001700                          ACTUAL.
001800
001900        ADD 1 TO TEST-RUN
002000        IF ACTUAL = EXPECTED
002100            ADD 1 TO PASSES
002110            DISPLAY 'EXPECTED :' EXPECTED
002120            DISPLAY 'ACTUAL   :' ACTUAL
002200        ELSE
002300            ADD 1 TO FAILURES
002400            DISPLAY 'FAILED   : ' TEST-NAME
002500            DISPLAY 'EXPECTED :' EXPECTED
002600            DISPLAY 'ACTUAL   :' ACTUAL
002700        END-IF
002800
002900        GOBACK.
