000100 ID DIVISION.
000200 PROGRAM-ID.  PP2D.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000520 01 WS-RES PIC X(10).
000600
000800 LINKAGE SECTION.
001200 01 LS-RES      PIC X(10).
001300 01 LS-INPUT.
001301    10 O-DAY        PIC X(2).
001302    10 SEPARATOR        PIC X.
001303    10 O-MON        PIC X(2).
001304    10 SEPARATOR        PIC X.
001305    10 O-YEA        PIC X(4).
001310
001400 PROCEDURE DIVISION USING LS-RES
001800                          LS-INPUT.
001801     MOVE ZERO TO WS-RES
001802
001810     STRING O-YEA DELIMITED BY SIZE
001820                '-' DELIMITED BY SIZE
001830            O-MON DELIMITED BY SIZE
001840                '-' DELIMITED BY SIZE
001850            O-DAY DELIMITED BY SIZE
001860            INTO WS-RES
002400
002500     MOVE WS-RES TO LS-RES
002600
002700     GOBACK.
