000100 ID DIVISION.
000200 PROGRAM-ID.  PP2T.
000201
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
001202 01 WS-TEST-NAME    PIC X(30).
001203 01 WS-UTEST-INPUT  PIC X(10).
001204 01 WS-EXPECTED-RES PIC X(10) VALUE ZERO.
001205 01 WS-UTEST-RES    PIC X(10).
001211
001220 77 L-SEP       PIC X(50) VALUE ALL '*'.
001230
001240 LINKAGE SECTION.
001250 COPY TESTCONT.
001260
001300
001400 PROCEDURE DIVISION USING TEST-CONTEXT.
001800
001900     PERFORM FRENCH-DATE-TEST
002000     DISPLAY 'RUN : ' TEST-RUN ' OK : ' PASSES ' ECHEC : '
002100               FAILURES
002295
002296     PERFORM SEPARATOR-TEST
002297     DISPLAY 'RUN : ' TEST-RUN ' OK : ' PASSES ' ECHEC : '
002298               FAILURES
002299
002300     PERFORM ENGLISH-DATE-TEST
002301     DISPLAY 'RUN : ' TEST-RUN ' OK : ' PASSES ' ECHEC : '
002302               FAILURES
002303
002310     GOBACK.
002400
002411 FRENCH-DATE-TEST.
002440     MOVE '15/10/2020' TO WS-UTEST-INPUT
002441     MOVE '2020-10-15' TO WS-EXPECTED-RES
002443
002450     MOVE 0    TO WS-UTEST-RES
002460     CALL 'PP2D' USING BY REFERENCE WS-UTEST-RES
002461                       BY CONTENT WS-UTEST-INPUT
002490
002491     MOVE 'FRENCH-DATE-TEST' TO WS-TEST-NAME
002492     DISPLAY '--------------- ' WS-TEST-NAME
002493
002494     CALL 'ASSEQ' USING BY REFERENCE TEST-CONTEXT
002495                        BY CONTENT   WS-TEST-NAME
002496                        BY CONTENT   WS-EXPECTED-RES
002497                        BY CONTENT   WS-UTEST-RES
002498     .
002499
002600 SEPARATOR-TEST.
002700     MOVE '15-10-2020' TO WS-UTEST-INPUT
002800     MOVE '2020-10-15' TO WS-EXPECTED-RES
002900
003000     MOVE 0    TO WS-UTEST-RES
003100     CALL 'PP2D' USING BY REFERENCE WS-UTEST-RES
003200                       BY CONTENT WS-UTEST-INPUT
003300
003400     MOVE 'SEPARATOR-TEST' TO WS-TEST-NAME
003500     DISPLAY '--------------- ' WS-TEST-NAME
003600
003700     CALL 'ASSEQ' USING BY REFERENCE TEST-CONTEXT
003800                        BY CONTENT   WS-TEST-NAME
003900                        BY CONTENT   WS-EXPECTED-RES
004000                        BY CONTENT   WS-UTEST-RES
004100     .
004200
004300 ENGLISH-DATE-TEST.
004400     MOVE '2020-10-15' TO WS-UTEST-INPUT
004500     MOVE '2020-10-15' TO WS-EXPECTED-RES
004600
004700     MOVE 0    TO WS-UTEST-RES
004800     CALL 'PP2D' USING BY REFERENCE WS-UTEST-RES
004900                       BY CONTENT WS-UTEST-INPUT
005000
005100     MOVE 'ENGLISH-DATE-TEST' TO WS-TEST-NAME
005200     DISPLAY '--------------- ' WS-TEST-NAME
005300
005400     CALL 'ASSEQ' USING BY REFERENCE TEST-CONTEXT
005500                        BY CONTENT   WS-TEST-NAME
005600                        BY CONTENT   WS-EXPECTED-RES
005700                        BY CONTENT   WS-UTEST-RES
005800     .
005900
